# GetWallSweepsInfo Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..GetWallSweepsInfo Method
CompoundStructure Class See Also
---
Obtains a list of the intrinsic wall sweeps or reveals in this CompoundStructure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<WallSweepInfo> GetWallSweepsInfo(
	WallSweepType wallSweepType
)
```

Visual Basic
---
```text
Public Function GetWallSweepsInfo ( _
	wallSweepType As WallSweepType _
) As IList(Of WallSweepInfo)
```

Visual C++
---
```text
public:
IList<WallSweepInfo^>^ GetWallSweepsInfo(
	WallSweepType wallSweepType
)
```

# ### Parameters
wallSweepType
    Type: Autodesk.Revit.DB..::..WallSweepType Whether to obtain wall sweeps or reveals.
# ### Return Value
An array which describes the intrinsic wall sweeps or reveals.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace